{
  "jingleringford": [
    "Welcome to the Geese Islands and the 2023 SANS Holiday Hack Challenge!",
    "I'm Jingle Ringford, one of Santa's many elves.",
    "Santa asked me to meet you here and give you a short orientation to this festive event.",
    "Before you head back to your boat, I'll ask you to accomplish a few simple tasks.",
    "First things first, here's your badge! It's that starfish in the middle of your avatar.",
    "Great - now you're official!",
    "Click on the badge on your avatar. That's where you will see your Objectives, Hints, and Conversations for the Holiday Hack Challenge.",
    "We've also got handy links to some awesome talks and more there for you!",
    "Next, pick up that fishing pole over there in the sand. That will come in handy when you're sailing around the islands.",
    "...",
    "Fantastic!",
    "OK, one last thing. Click on the **Cranberry Pi Terminal** and follow the on-screen instructions.",
    "Perfect! Your orientation is now complete!",
    "Head back to your boat or click on the anchor icon on the left of the screen to set sail for Frosty's Beach where Santa's waiting for you. I've updated your boat's compass to guide the way.",
    "As you sail to each island, talk to the goose of that island to receive a colorful lei festooning the masts on your ship.",
    "Safe travels my friend and remember, relax, enjoy the sun, and most importantly, have FUN!"
  ],
  "gingerbreddie": [
    "Hey, welcome to Santa's Surf Shack on tropical Christmas Island! I'm just hanging ten here, taking it easy while brushing up on my Linux skills.",
    "You ever tried getting into Linux? It's a super cool way to play around with computers.",
    "Can you believe ChatNPT suggested this trip to the Geese Islands this year? I'm so thrilled!",
    "Kudos to ChatNPT, eh? The sunshine, the waves, and my surfboard – simply loving it!",
    "So, what do you have planned? Care to join me in a Linux session?",
    "...",
    "Wow, if your surfing skills are as good as your Linux skills, you could be winning competitions!"
  ],
  "boothgoogle": [
    "Google is a proud sponsor of the Holiday Hack Challenge. We wish you a happy holiday hacking season.",
    "[Meet Security Engineers at Google](https://www.youtube.com/watch?v=-6ZbrfSRWKc)!",
    "..."
  ],
  "boothmicrosoft": [
    "For more learning resources, check out [Microsoft Learning Paths for Security Operations](https://learn.microsoft.com/en-us/training/browse/?subjects=security&resource_type=learning%20path&roles=security-operations-analyst)!",
    "Special thank you to KC7 and  the Kusto Detective Agency team for their partnership on HHC from all of us at Microsoft Federal.",
    "If you liked the challenge, check out [KC7](https://kc7cyber.com/) and [Kusto Detective Agency](https://detective.kusto.io/)!",
    "..."
  ],
  "boothsansedu": [
    "Happy holidays from the best college in cybersecurity!",
    "Use code “BestCollege4Hackers” to waive your application fee for any [SANS.edu](https://www.sans.edu/) degree or certificate program between now and March 31, 2024.",
    "..."
  ],
  "boothamazon": [
    "Securing smiles and advancing community this holiday season - _from Amazon_",
    "[Learn more](https://www.aboutamazon.com/news/workplace/amazon-apprenticeship-job-training-programs)",
    "..."
  ],
  "posterhackspacecon": [
    "Happy Holidays from the Hack Space Con team!",
    "Looking for some space fun in a warm climate this Spring?  Check out our con at [https://www.hackspacecon.com](https://www.hackspacecon.com).",
    "..."
  ],
  "posterpresidentscup": [
    "Are you a US federal government civilian employee or military service member?",
    "Prove you are among the federal government’s best and brightest cybersecurity talent in the [Fifth Annual President’s Cup Competition](https://www.cisa.gov/presidents-cup-cybersecurity-competition).",
    "..."
  ],
  "santaapproach": [
    "Welcome to the Geese Islands, fellow traveler! This one is called Christmas Island. Nooo ho ho, not _that_ Christmas Island.",
    "After countless years of shivering and shaking through each holiday season, I thought to myself, \"Why not trade the snowflakes for sunbeams, just once?\"",
    "Oh, the North Pole has its charm, but the bones do yearn for a bit of warmth now and then.",
    "The notion was suggested by my good friend, Chat North Pole Technology, or as we like to call it, 'ChatNPT'. That's the one we use, but there's a whole slew of other AI platforms. You should try them out!",
    "It came to me describing palm trees and gentle waves, saying, \"Santa, let your holidays take flight to Geese Islands, where the warmth isn't just a setting.\"",
    "\"There, every day is a sunny scene straight out of a vintage film reel.\"",
    "I chuckled at the thought, my belly shaking like a bowl full of jelly.",
    "But the AI persisted, \"Winter's best kept secret: the balmy breezes of Geese Islands!\"",
    "And I must confess, the sound of that did stroke my beard with curiosity.",
    "So, I called a meeting with the elves, the reindeer, and Mrs. Claus, of course.The elves were all a-buzz with the idea of crafting toys with a view of the ocean!",
    "Thus, we packed up our sleighs and ChatNPT charted a course for the Geese Islands, a tropical paradise just north of the equator..",
    "And I must say, there's something quite magical about a Christmas carol sung to the strum of a ukulele.",
    "After all, the magic of the holidays isn't in the snow or the cold, but in the love and the care that we put into each and every gift.",
    "So here's to trying new things, to following the sunshine, and to the Geese Islands, where the holiday cheer is sun-kissed and the Christmas spirit is as warm as the tropical breeze.",
    "And it's all thanks to a little nudge from ChatNPT.",
    "Now, why not start off your vacation with a snowball fight with Morcel, or check out my surf shack on the other end of the beach?",
    "However you decide to relax, be sure to soak in all the whimsical beauty of these magical islands, and enjoy the activities to the fullest!",
    "...",
    "Congratulations! You are a true snowball fight champion and thank you so much for helping out Ginger Breddie!",
    "Oh, it feels like the warm and gentle winds are starting to pick up!",
    "The perfect time to head back to your boat and embark on an adventure to all the other whimsical places the Geese Islands have to offer!",
    "Safe travels my friend and thank you again for your help!"
  ],
  "goosechristmas": [
    "Honk honk",
    "..."
  ],
  "morcelnougat": [
    "Hey there, I'm Morcel Nougat, elf extraordinaire!",
    "You won't believe this, but we're on a magical tropical island called Christmas Island, and it even has snow!",
    "I'm so glad ChatNPT suggested we come here this year!",
    "Santa, some elves, and I are having a snowball fight, and we'd love you to join us. Santa's really good, so trust me when I say it's way more fun when played with other people. ",
    "But hey, if you can figure out a way to play solo by tinkering with client side variables or parameters to go solo mode, go for it!",
    "There's also ways to make the elves' snowballs do no damage, and all kinds of other shenanigans, but you didn't hear that from me.",
    "Just remember, it's all about having fun and sharing the joy of the holiday season with each other.",
    "So, are you in? We'd really love your company in this epic snowball battle!",
    "...",
    "You're like a snowball fighting ninja! A real-life legend. Can I have your autograph!?"
  ],
  "noelboetie": [
    "Hey there, Noel Boetie speaking! I recently tried using ChatNPT to generate my penetration testing report.",
    "It's a pretty nifty tool, but there are a few issues in the output that I've noticed.",
    "I need some guidance in finding any errors in the way it generated the content, especially those odd hallucinations in the LLM output.",
    "I know it's not perfect, but I'd really appreciate the extra eyes on this one.",
    "Some of the issues might be subtle, so don't be afraid to dig deep and ask for further clarification if you're unsure.",
    "I've heard that you folks are experts about LLM outputs and their common issues, so I trust you can help me with this.",
    "Your input will be invaluable to me, so please feel free to share any insights or findings you may have.",
    "I'm looking forward to working with you all and improving the quality of the ChatNPT-generated penetration testing report.",
    "Thanks in advance for your help! I truly appreciate it! Let's make this report the best it can be!",
    "...",
    "Great job on completing that challenge! Ever thought about how your newfound skills might come into play later on? Keep that mind sharp, and remember, today's victories are tomorrow's strategies!"
  ],
  "sparkleredberry": [
    "Hey, Sparkle Redberry here! So, I've been trying to learn about Azure and the Azure CLI and it's driving me nuts.",
    "Alabaster Snowball decided to use Azure to host some of his fancy new IT stuff on Geese Islands, and now us elves have to learn it too.",
    "Anyway, I know it's important and everyone says it's not as difficult as it seems, but honestly it still feels like quite a challenge for me.",
    "Alabaster sent us this [Azure CLI reference](https://learn.microsoft.com/en-us/cli/azure/reference-index?view=azure-cli-latest) as well. It's super handy, he said. Honestly, it just confuses me even more.",
    "If you can spare a moment, would you mind giving me a hand with this terminal? I'd be really grateful! Pretty please, with holly leaves on top!",
    "...",
    "Wow, you did it!",
    "It makes quite a bit more sense to me now. Thank you so much!",
    "That Azure Function App [URL](https://northpole-ssh-certs-fa.azurewebsites.net/api/create-cert?code=candy-cane-twirl) you came across in the terminal looked interesting.",
    "It might be part of that new project Alabaster has been working on with the help of ChatNPT.",
    "Let me tell you, since he started using ChatNPT he's been introducing a lot of amazing innovation across the islands.",
    "Knowing Alabaster, he'll be delighted to tell you all about it! I think I last saw him on Pixel island.",
    "By the way, as part of the Azure documentation he sent the elves, Alabaster also noted that if Azure CLI tools aren't available in an Azure VM we should use the [Azure REST API](https://learn.microsoft.com/en-us/entra/identity/managed-identities-azure-resources/how-to-use-vm-token) instead.",
    "I'm not really sure what that means, but I guess I know what I'll be studying up on next."
  ],
  "pepperminstix": [
    "Well hello there! I'm Pepper Minstix.",
    "Say, do you like cotton candy by any chance?",
    "I used to own a little cotton candy maker, but I like cotton candy so much that I decided to upgrade. Behold! The _Cotton Candy Colossus 2.0_.",
    "Can I interest you in free cotton candy? What do you say! They are absolutely amazing!",
    "Have fun on the Geese Islands! There's still more to discover --",
    "Like sailing your boat along the various coast lines to find new ports, catch some fish, meet new friends, or provide your expertise and assistance where needed.",
    "After you complete all the challenges, come back here for a surprise!",
    "..."
  ],
  "wunorseopenslae": [
    "Welcome, brave souls, to the most thrilling cyber quest of the year! Ready your wits and sharpen your skills, for the digital realm awaits!",
    "I'm Wunorse, your helper in this festive cyber journey. Whether you're a seasoned hacker or a budding cyber sleuth, you're in for an epic experience!",
    "As we embark on this adventure, remember, every challenge is a chance to shine brighter! Let's tackle these puzzles with the joy and teamwork befitting this jolly season!",
    "Keep your eyes peeled for clues and your spirits high. In the world of NetWars, every click can lead to wonderful discoveries!",
    "May your codes be bug-free and your solutions creative. Let NetWars begin, and may the best cyber elf win!",
    "Let the games begin!",
    "..."
  ],
  "shiftymcshuffles": [
    "Hey there, stranger! Fancy a game of cards? Luck's on your side today, I can feel it.",
    "Step right up, test your wit! These cards could be your ticket to fortune.",
    "Trust me, I've got a good eye for winners, and you've got the look of luck about you.",
    "Plus, I'd wager you've never played this game before, as this isn't any ordinary deck of cards. It's made with [Python](https://www.tenable.com/blog/python-nan-injection).",
    "The name of the game is to bamboozle the dealer.",
    "So whad'ya think? Are you clever enough?",
    "...",
    "Well, you sure are more clever than most of the tourists that show up here.",
    "I couldn't swindle ya, but don't go telling everyone how you beat me!",
    "An elf's gotta put food on the table somehow, and I'm doing the best I can with what I got."
  ],
  "wombleycubechiaroscurocity": [
    "Wombley Cube here, welcome to Chiaroscuro City!",
    "Have you heard about my latest project?",
    "I've been so inspired by these wonderful islands I've decided to write a short story!",
    "The title? It's \"The Enchanted Voyage of Santa and his Elves to the Geese Islands.\" Sounds exciting, right?",
    "Here, have this [audiobook](https://www.holidayhackchallenge.com/2023/wombleycube_the_enchanted_voyage.mp3.zip) copy and enjoy the adventure at your convenience, my friend!",
    "Consider it a welcome gift from yours truly, to make your holiday even more delightful.",
    "Trust me, this captivating tale of fiction is going to take you on a magical journey you won't forget.",
    "Oh, and I promise it will provide some great entertainment while you explore the rest of Geese Islands!",
    "Hey, did you have a chance to listen to my [audiobook](https://www.holidayhackchallenge.com/2023/wombleycube_the_enchanted_voyage.mp3.zip) yet?",
    "So, what did you think?",
    "I've got a pretty suave voice, right?",
    "..."
  ],
  "goosenoir": [
    "mmooooOOOO",
    "..."
  ],
  "tanglecoalbox": [
    "Greetings, rookie. Tangle Coalbox of Kusto Detective Agency here.",
    "I've got a network infection case on Film Noir Island that needs your expertise.",
    "Seems like someone clicked a phishing link within a client's organization, and trouble's brewing.",
    "I'm swamped with cases, so I need an extra pair of hands. You up for the challenge?",
    "You'll be utilizing the Azure Data Explorer and those KQL skills of yours to investigate this incident.",
    "Before you start, you'll need to (create a free cluster)[https://dataexplorer.azure.com/freecluster].",
    "Keep your eyes peeled for suspicious activity, IP addresses, and patterns that'll help us crack this case wide open.",
    "Remember, kid, time is of the essence. The sooner we can resolve this issue, the better.",
    "If you run into any problems, just give me a holler, I've got your back.",
    "Good hunting, and let's bring this cyber criminal to justice.",
    "Once you've got the intel we need, report back and we'll plan our next move. Stay sharp, rookie.",
    "...",
    "I had my doubts, but you've proven your worth.",
    "That phishing scheme won't trouble our client's organization anymore, thanks to your keen eye and investigatory prowess.",
    "So long, Gumshoe, and be careful out there."
  ],
  "jewelloggins": [
    "What are _you_ doing here, and who are you?",
    "Me first? I'm Jewel Loggins. And I was trekking through the jungle and happened to find this place.",
    "I liked this spot and decided to set up camp. Seeing you here is quite the surprise.",
    "Well, because the only other person I've ever seen come here is Wombley Cube.",
    "I thought this tram station in the middle of the jungle was strange to begin with, but then Wombley added to the intrigue.",
    "I guess all this spy stuff is typical for him, so maybe I shouldn't think much of it. I'm sure everything's fine.",
    "Every time he comes here, he says something to the speaker. Then, the door opens, and he rides the tram somewhere.",
    "I gave it a try, but the door didn't open for me. Knowing Wombley, it's some kind of secret passphrase.",
    "If you wanna see where the tram goes, I think you need to find out what that passphrase is.",
    "Ribb Bonbowford over at Coggoggle Marina on Steampunk Island works with Wombley. Try asking if he knows.",
    "I hope you find it. I'll be here when you get back!",
    "...",
    "What, you know the passphrase!? Let me try it!",
    "Nope, didn't work. Knowing Wombley, the passphrase isn't the only requirement. He's all about that MFA!",
    "Oh yeah, multi-factor authentication! The passphrase for something he knows, and his voice for something he is!",
    "That's it! You need to be Wombley. You need his voice. Now, how are you gonna get that?",
    "Since only us elves can get a subscription to use ChatNPT, try searching for another AI tool that can simulate voices. I'm sure there's one out there.",
    "Are you like a master spy or something? I've only seen stuff like that in the movies!",
    "It sure is scary what you can do with AI, huh? I sure hope ChatNPT has better guardrails in place."
  ],
  "goosespace": [
    "GRUNT",
    "..."
  ],
  "goosesteampunk": [
    "cluck cluck",
    "..."
  ],
  "ribbbonbowford": [
    "Hi there, could you do me a quick favor?",
    "Can you go and check on Alabaster Snowball for me? He's at Rainraster Cliffs on Pixel Island. I heard some rumors he's been experimenting with ChatNPT again and I'm a little worried about what he's cooking up.",
    "Thank you so much!",
    "Please let me know what you find out. ",
    "...",
    "Hello, I'm Ribb Bonbowford. Nice to meet you!",
    "Oh golly! It looks like Alabaster deployed some vulnerable Azure Function App Code he got from ChatNPT.",
    "Don't get me wrong, I'm all for testing new technologies. The problem is that Alabaster didn't review the generated code and used the Geese Islands Azure production environment for his testing.",
    "I'm worried because our Active Directory server is hosted there and Wombley Cube's research department uses one of its fileshares to store their sensitive files. ",
    "I'd love for you to help with auditing our Azure and Active Directory configuration and ensure there's no way to access the research department's data.",
    "Since you have access to Alabaster's SSH account that means you're already in the Azure environment. Knowing Alabaster, there might even be some useful tools in place already.",
    "Wow, nice work. I'm impressed!",
    "This is all starting to feel like more than just a coincidence though. Everything Alabaster's been setting up lately with the help of ChatNPT contains all these vulnerabilities. It almost feels deliberate, if you ask me.",
    "Now obviously an LLM AI like ChatNPT cannot have deliberate motivations itself. It's just a machine. But I wonder who could have built it and who is controlling it?",
    "On top of that, we apparently have a satellite ground station on Geese Islands. I wonder where that thing would even be located.",
    "Well, I guess it's probably somewhere on Space Island, but I've not been there yet.",
    "I'm not a big fan of jungles, you see. I have this tendency to get lost in them.",
    "Anyway, if you feel like investigating, that'd be where I'd go look.",
    "Good luck and I'd try and steer clear of ChatNPT if I were you."
  ],
  "jason": [
    "Hi, I'm Jason!",
    "I'm not dead.",
    "I'm just soaking up the sun's gnarly vibes, bro!",
    "..."
  ],
  "alabastersnowball": [
    "Hey there! I'm currently a bit swamped with this Azure deployment. ",
    "Once I'm done I'll tell you about it. It's pretty awesome!",
    "You'll need a bit of Azure knowledge though. Sparkle Redberry can help you get up to speed on that. You can find her at the Rudolph's Rest Resort on Christmas Island.",
    "...",
    "Hello there! Alabaster Snowball at your service.",
    "I could use your help with my fancy new Azure server at **ssh-server-vm.santaworkshopgeeseislands.org**.",
    "ChatNPT suggested I upgrade the host to use SSH certificates, such a great idea!",
    "It even generated ready-to-deploy code for an [Azure Function App](https://northpole-ssh-certs-fa.azurewebsites.net/api/create-cert?code=candy-cane-twirl) so elves can request their own certificates. What a timesaver!",
    "I'm a little wary though. I'd appreciate it if you could take a peek and confirm everything's secure before I deploy this configuration to all the Geese Islands servers.",
    "Generate yourself a certificate and use the _monitor_ account to access the host. See if you can grab my TODO list.",
    "If you haven't heard of SSH certificates, Thomas Bouve gave an introductory talk and demo on that topic recently.",
    "Oh, and if you need to peek at the Function App code, there's a handy [Azure REST API endpoint](https://learn.microsoft.com/en-us/rest/api/appservice/web-apps/get-source-control) which will give you details about how the Function App is deployed.",
    "Oh my! I was so focused on the SSH configuration I completely missed the vulnerability in the Azure Function App.",
    "Why would ChatNPT generate code with such a glaring vulnerability? It's almost like it wanted my system to be unsafe. Could ChatNPT be evil?",
    "Thanks for the help, I'll go and update the application code immediately!",
    "While we're on the topic of certificates, did you know Active Directory (AD) uses them as well? Apparently the service used to manage them can have misconfigurations too.",
    "You might be wondering about that SatTrackr tool I've installed on the monitor account?",
    "Here's the thing, on my nightly stargazing adventures I started noticing the same satellite above Geese Islands.",
    "I wrote that satellite tracker tool to collect some additional data and sure enough, it's in a geostationary orbit above us.",
    "No idea what that means yet, but I'm keeping a close eye on that thing!"
  ],
  "pineysappington": [
    "Hey there, friend! Piney Sappington here.",
    "You look like someone who's good with puzzles and games.",
    "I could really use your help with this Elf Hunt game I'm stuck on.",
    "I think it has something to do with manipulating JWTs, but I'm a bit lost.",
    "If you help me out, I might share some juicy secrets I've discovered.",
    "Let's just say things around here haven't been exactly... normal.",
    "So, what do ya say? Are you in?",
    "Oh, brilliant! I just know we'll crack this game together.",
    "I can't wait to see what we uncover, and remember, mum's the word!",
    "Thanks a bunch! Keep your eyes open and your ears to the ground.",
    "...",
    "Well done! You've brilliantly won Elf Hunt! I couldn't be more thrilled. Keep up the fine work, my friend!",
    "What have you found there? The Captain's Journal? Yeah, he comes around a lot. You can find his comms office over at Brass Buoy Port on Steampunk Island."
  ],
  "goosepixel": [
    "hisssss",
    "..."
  ],
  "poinsettiamcmittens": [
    "Excuse me, but you're interrupting my fishing serenity. Oh, you'd like to know how to become as good at fishing as I am?",
    "Well, first of all, thank you for noticing my flair for fishing. It's not just about looking good beside the lake, you know.",
    "The key is in the details, much like crafting the perfect toy. Observe the water, the weather, and the fish’s habits - it's a science and an art.",
    "Of course, it helps to have a natural charm. Fish seem to find me irresistible. Must be my sparkling personality... or maybe it's just the glitter of my allure.",
    "Oh, the mysteries of the aquatic life around these islands are as elusive as, well, a clever compliment. But you'll get one if you probe enough.",
    "Remember, patience is more than a virtue in fishing; it’s a strategy. Like waiting for the right time to use flattery, you wait for the right moment to strike.",
    "Go see if you can catch, say, 20 different types of fish!",
    "..."
  ],
  "goosemisfit": [
    "Beep beep",
    "..."
  ],
  "garlandcandlesticks": [
    "Hey there, I'm Garland Candlesticks! I could really use your help with something.",
    "You see, I have this important pamphlet in my luggage, but I just can't remember the combination to open it!",
    "Chris Elgee gave a talk recently that might help me with this problem. Did you attend that?",
    "I seem to recall Chris mentioning a technique to figure out the combinations...",
    "I have faith in you! We'll get that luggage open in no time.",
    "This pamphlet is crucial for me, so I can't thank you enough for your assistance.",
    "Once we retrieve it, I promise to treat you to a frosty snack on me!",
    "...",
    "Wow, you did it! I knew you could crack the code. Thank you so much!"
  ],
  "dustygiftwrap": [
    "Arrr, matey, shiver me timbers! There be buried treasure herrrrre.",
    "Just kidding, I'm not really a pirate, I was just hoping it would make finding the treasure easier.",
    "I guess you heard about the fabled buried treasure, too? I didn't expect to see anyone else here. This uncharted islet was hard to find.",
    "There are 3 buried treasures in total, each in its own uncharted area around Geese Islands.",
    "I've been searching for hours now with no luck, and these strange toys are starting to give me the creeps.",
    "Maybe you'll be able to find it. Here, use my Gameboy Cartridge Detector. Go into your items and test it to make sure it's still working.",
    "When you get close to the treasure, it'll start sounding off. The closer you get, the louder the sound.",
    "No need to activate or fiddle with it. It just works!",
    "I bet one of these creepy toys has the treasure, and I'm sure not going anywhere near them!",
    "If you find the treasure, come back and show me, and I'll tell you what I was able to research about it.",
    "Good luck!",
    "...",
    "Whoa, you found it!",
    "It's a... video game cartridge? Coooooollll... I mean, arrrrrr....",
    "So, here's what my research uncovered. Not sure what it all means, maybe you can make sense of it."
  ],
  "bowninecandle": [
    "Hey there! I'm Bow Ninecandle, and I've got a bit of a... 'pressing' situation.",
    "You see, I need to get into the lavatory, but here's the twist: it's secured with a combination padlock.",
    "Talk about bad timing, right? I could really use your help to figure this out before things get... well, urgent.",
    "I'm sure there are some clever tricks and tips floating around [the web](https://www.youtube.com/watch?v=27rE5ZvWLU0) that can help us crack this code without too much of a flush... I mean fuss.",
    "Remember, we're aiming for quick and easy solutions here - nothing too complex.",
    "Once we've gathered a few possible combinations, let's team up and try them out.",
    "I'm crossing my legs - I mean fingers - hoping we can unlock this door soon.",
    "After all, everyone knows that the key to holiday happiness is an accessible lavatory!",
    "Let's dive into this challenge and hopefully, we won't have to 'hold it' for too long! Ready to help me out?",
    "..."
  ],
  "chimneyscissorsticks": [
    "Ahoy there, I'm Chimney Scissorsticks!",
    "You may have noticed some mischief-makers planning to stir up trouble ashore.",
    "They've made many radio broadcasts which the captain has been monitoring with his new software defined radio (SDR).",
    "The new SDR uses some fancy JWT technology to control access.",
    "The captain has a knack for shortening words, some sorta abbreviation trick.",
    "Not familiar with JWT values? No worries; just think of it as a clue-solving game.",
    "I've seen that the Captain likes to carry his journal with him wherever he goes.",
    "If only I could find the planned \"go-date\", \"go-time\", and radio frequency they plan to use.",
    "Remember, the captain's abbreviations are your guiding light through this mystery!",
    "Once we find a JWT value, these villains won't stand a chance.",
    "The closer we are, the sooner we'll be thwarting their pesky plans!",
    "We need to recreate an administrative JWT value to successfully transmit a message.",
    "Good luck, matey! I've no doubts about your cleverness in cracking this conundrum!",
    "...",
    "Heya, think you could help Piney Sappington on Rainraster Cliffs on Pixel Island and then give me a hand?"
  ],
  "evesnowshoes": [
    "Greetings, fellow adventurer! Welcome to Scaredy-Kite Heights, the trailhead of the trek through the mountains on the way to the wonderful Squarewheel Yard!",
    "I'm Eve Snowshoes, resident tech hobbyist, and I hear Alabaster is in quite the predicament.",
    "Our dear Alabaster forgot his password. He's been racking his jingle bells of memory with no luck.",
    "I've been trying to handle this password recovery thing parallel to this hashcat business myself but it seems like I am missing some tricks.",
    "So, what do you say, chief, ready to get your hands on some hashcat action and help a distraught elf out?",
    "..."
  ],
  "rosemold": [
    "What am I doing in this saloon? The better question is: what planet are _you_ from?",
    "Yes, I’m a troll from the Planet Frost. I decided to stay on Earth after Holiday Hack 2021 and live among the elves because I made such dear friends here.",
    "Whatever. Do you know much about privilege escalation techniques on Linux?",
    "You're asking why? How about I'll tell you why after you help me.",
    "And you might have to use that big brain of yours to get creative, bub.",
    "...",
    "Yup, I knew you knew. You just have that vibe.",
    "To answer your question of why from earlier... Nunya!",
    "But, I will tell you something better, about some information I... found.",
    "There's a hidden, uncharted area somewhere along the coast of this island, and there may be more around the other islands.",
    "The area is supposed to have something on it that's totes worth, but I hear all the bad vibe toys chill there.",
    "That's all I got. K byyeeeee.",
    "Ugh... n00bs..."
  ],
  "tinselupatree": [
    "I discovered what looked liike an old pirate map in the attic of one of those huts in Rainraster Cliffs, and it actually led somewhere!",
    "But now that I've seen where it leads, I think this might've been a bad idea. This place is scary! Maybe you want to take it from here?",
    "There are 3 buried treasures in total, each in its own uncharted area around Geese Islands.",
    "I've been searching for a bit, but the mustiness down here is making me sneeze!",
    "Maybe you'll be able to find it. Here, use my Gameboy Cartridge Detector. Go into your items and test it to make sure it's still working.",
    "When you get close to the treasure, it'll start sounding off. The closer you get, the louder the sound.",
    "No need to activate or fiddle with it. It just works!",
    "I bet it's somewhere right...  near...  ACHOOO!",
    "If you find the treasure, come back and show me, and I'll tell you what I was able to research about it.",
    "Good luck!",
    "...",
    "Whoa, you found it!",
    "What version is it?",
    "Did you know that many games had multiple versions released? Word is: volume 2 has 2 versions!"
  ],
  "fitzyshortstack": [
    "Just my luck, I thought...",
    "A cybersecurity incident right in the middle of this stakeout.",
    "Seems we have a flood of unusual emails coming in through ChatNPT.",
    "Got a nagging suspicion it isn't catching all the fishy ones.",
    "You're our phishing specialist right? Could use your expertise in looking through the output of ChatNPT.",
    "Not suggesting a full-blown forensic analysis, just mark the ones screaming digital fraud.",
    "We're looking at all this raw data, but sometimes, it takes a keen human eye to separate the chaff, doesn't it?",
    "I need to get more powdered sugar for my donuts, so do ping me when you have something concrete on this.",
    "..."
  ],
  "angelcandysalt": [
    "At least it's obvious where this one is. See that shiny spot over to the right? That's gotta be where it is! If only I had a bird's eye view.",
    "But how to get there? Up? Down? Left? Right? Oh well, that's your problem now!",
    "Come back if you can find your way to it, and I'll tell you some secrets I've heard about this one.",
    "...",
    "The life of a treasure hunter isn't easy, but it sure is exciting!",
    "Oh it's a video game, I love video games! But you've claimed this treasure, nicely done.",
    "Now, about those secrets I've been told. They're pretty cryptic, but they are. Hopefully that helps with something!",
    "You have all three? Wow, you must be the greatest treasure hunter that ever lived!"
  ],
  "vendingmachine": [
    "Hi there! I am a Ground station client vending machine. Apparently there is a huge need for NanoSat frameworks here, so they have put me in this room. Here, have a [free sample](https://www.holidayhackchallenge.com/2023/client_container.zip)!",
    "..."
  ],
  "wombleycube": [
    "This is Ground Control, do you read me...? Ground Control to --",
    "Hey! How'd you get in here? That tram is the only accessible point of entry and I secured it with MFA!",
    "No matter, you may have had the skills to find and infiltrate the satellite ground station, but there's no chance you can hack your way into the satellite itself!",
    "The nanosat's Supervisor Directory will remain hidden, and you'll never discover the mastermind behind all this.",
    "So don't even waste your time trying.",
    "..."
  ],
  "henry": [
    "Hi, I'm Henry!",
    "I built the satellites with personalities, and now they keep making dad jokes - whoopsies!",
    "..."
  ]
}