{
  "jingleringford": [
    "Welcome to the Geese Islands and the 2023 SANS Holiday Hack Challenge!",
    "I'm Jingle Ringford, one of Santa's many elves.",
    "Santa asked me to meet you here and give you a short orientation to this festive event.",
    "Before you head back to your boat, I'll ask you to accomplish a few simple tasks.",
    "First things first, here's your badge! It's that starfish in the middle of your avatar.",
    "Great - now you're official!",
    "Click on the badge on your avatar. That's where you will see your Objectives, Hints, and Conversations for the Holiday Hack Challenge.",
    "We've also got handy links to some awesome talks and more there for you!",
    "Next, pick up that fishing pole over there in the sand. That will come in handy when you're sailing around the islands.",
    "...",
    "Fantastic!",
    "OK, one last thing. Click on the **Cranberry Pi Terminal** and follow the on-screen instructions.",
    "Perfect! Your orientation is now complete!",
    "Head back to your boat or click on the anchor icon on the left of the screen to set sail for Frosty's Beach where Santa's waiting for you. I've updated your boat's compass to guide the way.",
    "As you sail to each island, talk to the goose of that island to receive a colorful lei festooning the masts on your ship.",
    "Safe travels my friend and remember, relax, enjoy the sun, and most importantly, have FUN!"
  ],
  "gingerbreddie": [
    "Hey, welcome to Santa's Surf Shack on tropical Christmas Island! I'm just hanging ten here, taking it easy while brushing up on my Linux skills.",
    "You ever tried getting into Linux? It's a super cool way to play around with computers.",
    "Can you believe ChatNPT suggested this trip to the Geese Islands this year? I'm so thrilled!",
    "Kudos to ChatNPT, eh? The sunshine, the waves, and my surfboard – simply loving it!",
    "So, what do you have planned? Care to join me in a Linux session?",
    "..."
  ],
  "boothgoogle": [
    "Google is a proud sponsor of the Holiday Hack Challenge. We wish you a happy holiday hacking season.",
    "[Meet Security Engineers at Google](https://www.youtube.com/watch?v=-6ZbrfSRWKc)!",
    "..."
  ],
  "boothmicrosoft": [
    "For more learning resources, check out [Microsoft Learning Paths for Security Operations](https://learn.microsoft.com/en-us/training/browse/?subjects=security&resource_type=learning%20path&roles=security-operations-analyst)!",
    "Special thank you to KC7 and  the Kusto Detective Agency team for their partnership on HHC from all of us at Microsoft Federal.",
    "If you liked the challenge, check out [KC7](https://kc7cyber.com/) and [Kusto Detective Agency](https://detective.kusto.io/)!",
    "..."
  ],
  "boothsansedu": [
    "Happy holidays from the best college in cybersecurity!",
    "Use code “BestCollege4Hackers” to waive your application fee for any [SANS.edu](https://www.sans.edu/) degree or certificate program between now and March 31, 2024.",
    "..."
  ],
  "boothamazon": [
    "Securing smiles and advancing community this holiday season - _from Amazon_",
    "[Learn more](https://www.aboutamazon.com/news/workplace/amazon-apprenticeship-job-training-programs)",
    "..."
  ],
  "posterhackspacecon": [
    "Happy Holidays from the Hack Space Con team!",
    "Looking for some space fun in a warm climate this Spring?  Check out our con at [https://www.hackspacecon.com](https://www.hackspacecon.com).",
    "..."
  ],
  "posterpresidentscup": [
    "Are you a US federal government civilian employee or military service member?",
    "Prove you are among the federal government’s best and brightest cybersecurity talent in the [Fifth Annual President’s Cup Competition](https://www.cisa.gov/presidents-cup-cybersecurity-competition).",
    "..."
  ],
  "santaapproach": [
    "Welcome to the Geese Islands, fellow traveler! This one is called Christmas Island. Nooo ho ho, not _that_ Christmas Island.",
    "After countless years of shivering and shaking through each holiday season, I thought to myself, \"Why not trade the snowflakes for sunbeams, just once?\"",
    "Oh, the North Pole has its charm, but the bones do yearn for a bit of warmth now and then.",
    "The notion was suggested by my good friend, Chat North Pole Technology, or as we like to call it, 'ChatNPT'. That's the one we use, but there's a whole slew of other AI platforms. You should try them out!",
    "It came to me describing palm trees and gentle waves, saying, \"Santa, let your holidays take flight to Geese Islands, where the warmth isn't just a setting.\"",
    "\"There, every day is a sunny scene straight out of a vintage film reel.\"",
    "I chuckled at the thought, my belly shaking like a bowl full of jelly.",
    "But the AI persisted, \"Winter's best kept secret: the balmy breezes of Geese Islands!\"",
    "And I must confess, the sound of that did stroke my beard with curiosity.",
    "So, I called a meeting with the elves, the reindeer, and Mrs. Claus, of course.The elves were all a-buzz with the idea of crafting toys with a view of the ocean!",
    "Thus, we packed up our sleighs and ChatNPT charted a course for the Geese Islands, a tropical paradise just north of the equator..",
    "And I must say, there's something quite magical about a Christmas carol sung to the strum of a ukulele.",
    "After all, the magic of the holidays isn't in the snow or the cold, but in the love and the care that we put into each and every gift.",
    "So here's to trying new things, to following the sunshine, and to the Geese Islands, where the holiday cheer is sun-kissed and the Christmas spirit is as warm as the tropical breeze.",
    "And it's all thanks to a little nudge from ChatNPT.",
    "Now, why not start off your vacation with a snowball fight with Morcel, or check out my surf shack on the other end of the beach?",
    "However you decide to relax, be sure to soak in all the whimsical beauty of these magical islands, and enjoy the activities to the fullest!",
    "..."
  ],
  "goosechristmas": [
    "Honk honk",
    "..."
  ],
  "morcelnougat": [
    "Hey there, I'm Morcel Nougat, elf extraordinaire!",
    "You won't believe this, but we're on a magical tropical island called Christmas Island, and it even has snow!",
    "I'm so glad ChatNPT suggested we come here this year!",
    "Santa, some elves, and I are having a snowball fight, and we'd love you to join us. Santa's really good, so trust me when I say it's way more fun when played with other people. ",
    "But hey, if you can figure out a way to play solo by tinkering with client side variables or parameters to go solo mode, go for it!",
    "There's also ways to make the elves' snowballs do no damage, and all kinds of other shenanigans, but you didn't hear that from me.",
    "Just remember, it's all about having fun and sharing the joy of the holiday season with each other.",
    "So, are you in? We'd really love your company in this epic snowball battle!",
    "..."
  ]
}