{
  "boothgoogle": [
    "Google is a proud sponsor of the Holiday Hack Challenge. We wish you a happy holiday hacking season.",
    "[Meet Security Engineers at Google](https://www.youtube.com/watch?v=-6ZbrfSRWKc)!",
    "..."
  ],
  "rsacbooth": [
    "Happy Holidays! Join us April 28 - May 1, 2025 for [RSAC 2025](https://rsaconference.com/events/2025-usa/sans-holiday-hack).",
    "[Click to learn more](https://www.rsaconference.com/usa) about our program.",
    "..."
  ],
  "boothsansedu": [
    "Happy holidays from the best college in cybersecurity! ",
    "Use code “BestCollege4Hackers” to waive your application fee for any [SANS degree or certificate program](https://www.sans.edu/academics) in 2025.",
    "..."
  ],
  "swagbooth": [
    "Swag! Come and get your [Holiday Hack Challenge swag](https://my-store-d53a6c.creator-spring.com/)!",
    "..."
  ],
  "boothmicrosoft": [
    "Train Today, Secure Tomorrow with [Microsoft Security Academy](https://microsoft.github.io/PartnerResources/skilling/microsoft-security-academy).",
    "Check out [KC7's Cyber Detective Game](https://kc7cyber.com/), a free cyber game for everyone!",
    "Security is a team sport. Each year, Microsoft empowers our security community by sharing threat trends and insights in our [Digital Defense Report](http://aka.ms/MDDR).",
    "..."
  ],
  "boothamazon": [
    "Securing smiles and advancing community this holiday season - _from Amazon_",
    "[Learn more](https://www.aboutamazon.com/news/workplace/amazon-apprenticeship-job-training-programs).",
    "..."
  ],
  "posterhackspacecon": [
    "Happy Holidays from the Hack Space Con team! [www.hackspacecon.com](https://www.hackspacecon.com)",
    "..."
  ],
  "posterpresidentscup": [
    "Get ready for some holiday cheer! The future of cyber competitions is loading...",
    "Don’t miss out—register for Presidents Cup 6, starting December 9! Visit: [CISA.gov/presidentscup](https://CISA.gov/presidentscup) to join the fun!",
    "..."
  ],
  "poinsettiamcmittens": [
    "Ugh, all this packing up and moving crates is totally messing up my good vibes!",
    "I need a moment to soak up some rays and center myself, if you know what I'm saying?",
    "In the meantime, go see Jingle Ringford. He can help you with some basic island orientation.",
    "Positive thoughts... Need to think positive thoughts... Ooooommm...",
    "...",
    "Center your mind, and become one with the island!",
    "Relax...",
    "This isn't working! I'm trying to play this game but the whole \"moving back to the North Pole\" thing completely threw me off. ",
    "Say, how about you give it a try. It's really simple. All you need to do is help the elf get to the exit.",
    "The faster you get there, the better your score!",
    "I've run into some weirdness with the springs though. If I had created this game it would've been a lot more stable, but I won't **comment** on that any further.",
    "The rest of these elves are like corporate zombos. They just run around in circles unless you give them some direction.",
    "Way to pass them some of your super centered energy. Better you than me, though. I'd let them walk themselves straight off the island. ",
    "You took the easy win, it seems we're kindred spirits. But there's also a hard way to solve this challenge. ",
    "The more segments you use, the higher the reward. But who actually wants life to be more difficult?"
  ],
  "goosechristmas": [
    "HONK! HONK!",
    "..."
  ],
  "angelcandysalt": [
    "Hi there and welcome to Frosty's Beach! My name is Angel Candysalt. And before you ask, because everybody does, no... that is not... a euphemism!",
    "I'm in the middle of wrapping things up, but I heard Jingle Ringford wants to speak with you.",
    "Feel free to swing back here once you've finished your Prologue setup.",
    "...",
    "Welcome back, island adventurer! I'm Angel Candysalt — so happy to finally meet you!",
    "I'm thrilled you're here because I could really use a hand with something.",
    "Have you ever heard of a game called Connections?",
    "It’s simple! All you need to do is find groups of four related words.",
    "I've been stuck on it all day, and I'm sure someone as sharp as you will breeze through it.",
    "Oh, and while you're at it, check out randomElf's score — they hit fifty thousand points, which seems… oddly suspicious.",
    "Think they might have tampered with the game? Just a hunch!",
    "Amazing! You really connected all the dots like a pro.",
    "And guess what? You bumped randomElf off the leaderboard!",
    "Now, how about trying the game again — this time without any tampering or hacking.",
    "...",
    "Amazing! You really connected all the dots like a pro."
  ],
  "jingleringford": [
    "Welcome to the Geese Islands and the 2023 SANS Holiday Hack Challenge!",
    "I'm Jingle Ringford, one of Santa's many elves.",
    "...",
    "Just kidding! It's actually the 2024 SANS Holiday Hack Challenge!",
    "And although we're on Frosty's Beach on Christmas Island, we'll soon be on our way back to the North Pole.",
    "I thought it best to wait here for people that heard we're on the Geese Islands but may not know we're leaving.",
    "I haven't seen Santa since we started packing up, but he always asks me to give a quick orientation to newcomers, so I'm continuing the tradition.",
    "Before you head out any further onto the island, you need to accomplish two simple tasks.",
    "But first, here's a parting gift. I packed this snowball made of the magical, never-melting snow of Christmas Island. A little souvenir to take with you when we leave for the North Pole.",
    "Click on the snowball on your avatar. That's where you will see your Objectives, Hints, resource links, and Conversations for the Holiday Hack Challenge.",
    "Now, click on the **Cranberry Pi Terminal** and follow the on-screen instructions.",
    "You're a natural! Something new this year you may not know is that all challenges have an easy and hard mode. There's also story mode, if you want to skip the challenges and watch how our holiday season's adventure unfolds!",
    "Your snowball will reflect how you've solved the challenges with the bronze, silver, and gold trophies.",
    "Well, that's it, now you're orientated! Feel free to get yourself settled in, establish a cohort with others, or just explore this lovely island. Just be careful where you walk as we are moving around some pretty heavy crates.",
    "Oh, while we're preparing everything to set sail for the North Pole, I heard Poinsettia McMittens and Angel Candysalt could use some assistance. I'm sure they'll appreciate any help you can provide!",
    "We'll let you know when the boat leaves, but for now relax, enjoy the sun, and most importantly, have FUN!"
  ],
  "morcelnougat": [
    "Hello again! I'm Morcel Nougat, dashing around like a reindeer on a sugar rush! We've got a bit of a dilemma, and I could really use your expertise.",
    "Wombley and Alabaster have taken charge now that Santa’s gone missing, and We're scrambling to get the Wish List secured. But... one of the elves in the Data Management Team got overzealous, and the Shredder McShreddin 9000 gobbled up a crucial document we need to access Santa's chest!",
    "It’s our golden ticket to getting Santa’s Little Helper tool working properly. Without it, the hardware hack we're planning is as empty as Santa’s sleigh in January.",
    "Think you can help? I can get you into the Shredder McShreddin 9000’s inner workings to retrieve the pieces, but there are two access codes involved. One of the elves left a hint, but it’s all a blur to me!",
    "I've noticed that some elves keep referring to a certain book when they walk by. I bet it has the answers we need to crack the code and recover the document!",
    "You know, some of the elves always have their noses in the same book when they pass by here. Maybe it’s got the clues we need to crack the code?",
    "...",
    "WOW, you did it! You know, they say Ottendorf ciphers were used back in the Frosty Archives crisis… or was that during the Jack Frost incident? Either way, you're amazing!",
    "But wait—there’s still one more code tucked away! This one might need a bit more elbow grease… you may need to try a few combinations to crack it!",
    "Incredible work! You pieced together the code like a true sleuth and retrieved the shreds we need. I’m not quite sure how you’ll put them all together, but if anyone can, it’s you!",
    "Your help has been absolutely essential, especially now with Santa missing. Wombley and Alabaster will want to hear all about it—go share the news with Jewel Loggins!"
  ],
  "wombleycube": [
    "Greetings. It's great to see you've finally made the journey here to join us.",
    "Erm, by that I mean all of Santa's elves, of course. The big guy's not here, so I've been coordinating holiday preparation efforts.",
    "We're just hard at work getting things set up for... the holiday season. Present deliveries and what not.",
    "Some of us are also busy researching the best way to keep the Wish List and Naughty-Nice List uhh.. safe.",
    "Not to cut our conversation short, but you must be tired from your journey. You should go over to the fireplace and relax with the others that are taking a break.",
    "We're doing very important work over here and I need to make sure we stay on schedule.",
    "...",
    "Swell idea, playing cURL with Bow. Why don't you keep doing that."
  ],
  "alabastersnowball": [
    "Well hello, I'm Alabaster Snowball!",
    "As you can see all around you, we're still unpacking from our return from the Geese Islands.",
    "Strangely, Santa is still nowhere to be found. When we couldn't find him on Christmas Island, we thought he must already be here in the North Pole, but nope.",
    "Even though he's not here, I know he'd still want us to start preparing for the holiday present deliveries, so that's what we're gonna do!",
    "With all our equipment all jumbled up in boxes, we've been experimenting with ways of securely storing the lists related to our gift-giving operations. We tried implementing the Naughty-Nice List using Blockchain back in 2022 but Jack Frost hacked it and we are trying to find a suitable technical approach for securely storing it. Integrity is of critical importance.",
    "Without them, naughty listers may get all the good presents, and those that have been nice may get coal. Can you imagine? The horror! This isn't Halloween!",
    "I've asked my fellow elves to help out with this, since I'm not the most tech-savvy of the bunch. Many got right to it, but some are being quite ho-hum about it. That seems a little strange to me, but maybe they're just tired from the journey home.",
    "I may not be the sharpest tool in the repository when it comes to the technical stuff, but it seems I'm quite the galvanizer!",
    "Anywho, why not join Bow for a game of cURL? And then go help Morcel and Jewel with securing the Wish List, please. Thanks a bunch!",
    "...",
    "cURL-ing sure is fun huh! I bet you made Bow's day by playing with him. Everyone over here was too busy, and everyone on Wombley's side just refused to play. I wonder what's gotten into them. "
  ],
  "bowninecandle": [
    "Well hello there! I'm Bow Ninecandle, bright as a twinkling star! Everyone's busy unpacking, but I've grown quite bored of that. Care to join me for a lovely game?",
    "Oh Joy! Today, We're diving into something delightful: the curling challenge—without any ice, but plenty of sparkle!",
    "No icy brooms here though! We're all about Curl, sending web requests from the command line like magic messages.",
    "So, have you ever wielded Curl before? If not, no worries at all, my friend!",
    "It's this clever little tool that lets you whisper directly to web servers. Pretty neat, right?",
    "Think of it like sending secret scrolls through the interwebs, awaiting a wise reply!",
    "To begin, you can type something like curl https://example.com. Voilà! The HTML of the page appears, like conjuring a spell!",
    "Simple enough, huh? But oh, there's a whole world of magic you can cast with Curl!",
    "We're just brushing the surface here, but trust me—it’s a hoot and a half!",
    "If you get tangled up or need help, just give me a shout! I’m here to help you ace this curling spectacle.",
    "So, are you ready to curl those web requests like a pro? Let’s see your magic unfold!",
    "...",
    "Bravo! Look at you, curling through that like a true web wizard!",
    "You zipped through that challenge faster than a curling stone on enchanted ice!",
    "You know... rumor has it you can breeze through this with just three commands. Why don’t you give it a whirl?"
  ],
  "jewelloggins": [
    "Hello there! I’m Jewel Loggins.",
    "I hate to trouble you, but I really need some help. Santa’s Little Helper tool isn’t working, and normally, Santa takes care of this… but with him missing, it’s all on me.",
    "I need to connect to the UART interface to get things running, but it’s like the device just refuses to respond every time I try.",
    "I've got all the right tools, but I must be overlooking something important. I've seen a few elves with similar setups, but everyone’s so busy preparing for Santa’s absence.",
    "If you could guide me through the connection process, I’d be beyond grateful. It’s critical because this interface controls access to our North Pole access cards!",
    "We used to have a note with the serial settings, but apparently, one of Wombley’s elves shredded it! You might want to check with Morcel Nougat—he might have a way to recover it.",
    "...",
    "[Part 1] Fantastic! You managed to connect to the UART interface—great work with those tricky wires! I couldn't figure it out myself…",
    "[Part 1] Rumor has it you might be able to bypass the hardware altogether for the gold medal. Why not see if you can find that shortcut?",
    "[Part 2] Next, we need to access the terminal and modify the access database. We're looking to grant access to card number **42**.",
    "[Part 2] Start by using the slh application—that’s the key to getting into the access database. Problem is, the ‘slh’ tool is password-protected, so we need to find it first.",
    "[Part 2] Search the terminal thoroughly; passwords sometimes get left out in the open.",
    "[Part 2] Once you've found it, modify the entry for card number 42 to grant access. Sounds simple, right? Let’s get to it!"
  ],
  "tinselupatree": [
    "I'm so sad. I haven't found that cool pirate map that I discovered on Geese Islands yet. It must be in one of these crates somewhere.",
    "I should just keep helping unpack, unlike the elves over there, and it'll turn up eventually. ",
    "...",
    "Sure they look busy, but they're not actually helping with holiday preparations. They're just building.... I don't even know what."
  ],
  "noelboetie": [
    "Whew... unpacking sure is a chore. I'm so glad we set up this little break area to take a load off for a little while.",
    "Just me, the snow, chestnuts roasting over an open fire, and a cup of milk tea. The Geese Islands were relaxing and all, but this is what I call paradise.",
    "..."
  ],
  "goosepixel": [
    "(Spanish mode) Hi... welcome to Frosty's Beach! Nice to meet you!",
    "..."
  ],
  "goosechristmas2": [
    "Ugh, so happy we can all be ourselves again!",
    "..."
  ],
  "goosenoir": [
    "You want me to say what exactly?\nDo I really look like someone who says MOOO?",
    " ",
    "..."
  ],
  "goosespace": [
    "GRUNT! Oh silly me. I don't need to pretend anymore, do I?",
    "..."
  ],
  "goosesteampunk": [
    "CLUCK CLU... I think I might be losing my mind. All the elves are gone and I'm still hearing voices.",
    "..."
  ],
  "goosemisfit": [
    "Who knew all-inclusive meant just us and a campire? Amirite?",
    "..."
  ],
  "jason": [
    "Hi, I'm Jason!",
    "Where did everyone go?",
    "Guys?",
    "Helloooooooooo?!",
    "..."
  ]
}