{
  "santa-quad": [
    "This is a little embarrassing, but I need your help.",
    "Our KringleCon *turtle dove* mascots are missing!",
    "They probably just wandered off.",
    "Can you please help find them?",
    "To help you search for them and get acquainted with KringleCon, I’ve created some objectives for you. You can see them in your badge.",
    "Where's your badge? Oh! It's that big, circle emblem on your chest - give it a tap!",
    "We made them in two flavors - one for our new guests, and one for those who've attended both KringleCons.",
    "After you find the Turtle Doves and complete objectives 2-5, please come back and let me know.",
    "Not sure where to start? Try hopping around campus and talking to some elves.",
    "If you help my elves with some quicker problems, they'll probably remember clues for the objectives.",
    "...",
    "Thank you for finding Jane and Michael, our two turtle doves!",
    "I’ve got an uneasy feeling about how they disappeared.",
    "Turtle doves wouldn’t wander off like that.",
    "Someone must have stolen them! Please help us find the thief!",
    "It’s a moral imperative!",
    "I think you should look for an entrance to the steam tunnels and solve Challenge 6 and 7 too!",
    "Gosh, I can’t help but think:",
    "Winds in the East, snow coming in…",
    "Like something is brewing and about to begin!",
    "Can’t put my finger on what lies in store,",
    "But I fear what’s to happen all happened before!"
  ],
  "tanglecoalbox": [
    "Hey kid, it's me, Tangle Coalbox.",
    "I'm sleuthing again, and I could use your help.",
    "Ya see, this here number lock's been popped by someone.",
    "I think I know who, but it'd sure be great if you could open this up for me.",
    "I've got a few clues for you.",
    " 1. One digit is repeated once.",
    " 2. The code is a prime number.",
    " 3. You can probably tell by looking at the keypad which buttons are used.",
    "...",
    "Yep, that's it. Thanks for the assist, gumshoe.",
    "Hey, if you think you can help with another problem, Prof. Banas could use a hand too.",
    "Head west to the other side of the quad into Hermey Hall and find him in the Laboratory."
  ],
  "shinnyupatree": [
    "Hey there.",
    "...",
    "Wha - what?? You got into my crate?!",
    "_Well that's embarrassing..._",
    "But you know what? Hmm...  If you're good enough to crack MY security...",
    "Do you think you could bring this all to a grand conclusion?",
    "Please go into the sleigh shop and see if you can finish this off!",
    "Stop the Tooth Fairy from ruining Santa's sleigh route!"
  ],
  "kenttinseltooth": [
    "OK, this is starting to freak me out!",
    "Oh sorry, I'm Kent Tinseltooth.  My Smart Braces are acting up.",
    "Do...  Do you ever get the feeling you can hear things?  Like, voices?",
    "I know, I sound crazy, but ever since I got these...  Oh!",
    "Do you think you could take a look at my Smart Braces terminal?",
    "I'll bet you can keep other students out of my head, so to speak.",
    "It might just take a bit of Iptables work.",
    "...",
    "Oh thank you!  It's so nice to be back in my own head again.  Er, alone.",
    "By the way, have you tried to get into the crate in the Student Union?  It has an interesting set of locks.",
    "There are funny rhymes, references to perspective, and odd mentions of eggs!",
    "And if you think the stuff in your browser looks strange, you should see the page source...",
    "Special tools?  No, I don't think you'll need any extra tooling for those locks.",
    "BUT - I'm pretty sure you'll need to use Chrome's developer tools for that one.",
    "Or sorry, you're a Firefox fan?",
    "Yeah, Safari's fine too - I just have an ineffible hunger for a physical Esc key.",
    "Edge?  That's cool.  Hm?  No no, I was thinking of an unrelated thing.",
    "Curl fan?  Right on!  Just remember: the Windows one doesn't like double quotes.",
    "_Old school, huh?  Oh sure - I've got what you need right here..._"
  ],
  "googlebooth": [
    "Google is a proud sponsor of KringleCon and the Holiday Hack Challenge. We wish you a happy holiday hacking season.",
    "...",
    "You can try clicking on it, but sometimes a vent is just a vent."
  ],
  "stibooth": [
    "Happy holidays from the best college in cybersecurity.  Brilliant minds like yours belong at [SANS.edu](https://www.sans.edu/).",
    "..."
  ],
  "splunkbooth": [
    "Splunk is proud to be a contributor to KringleCon and the Holiday Hack Challenge. Happy holidays from the Splunk security team!",
    "..."
  ],
  "swagbooth": [
    "Want some [KringleCon swag?](https://teespring.com/stores/kringlecon-swag)",
    "Profit? No, we don't make anything on swag sales.",
    "..."
  ],
  "turtledoves": [
    "Hoot Hooot?",
    "..."
  ],
  "wunorseopenslae": [
    "Wunorse Openslae here, just looking at some Zeek logs.",
    "I'm pretty sure one of these connections is a malicious C2 channel...",
    "Do you think you could take a look?",
    "I hear a lot of C2 channels have very long connection times.",
    "Please use `jq` to find the longest connection in this data set.",
    "We have to kick out any and all grinchy activity!",
    "...",
    "That's got to be the one - thanks!",
    "Hey, you know what? We've got a crisis here.",
    "You see, Santa's flight route is planned by a complex set of machine learning algorithms which use available weather data.",
    "All the weather stations are reporting severe weather to Santa's Sleigh. I think someone might be forging intentionally false weather data!",
    "I'm so flummoxed I can't even remember how to login!",
    "Hmm... Maybe the Zeek http.log could help us.",
    "I worry about LFI, XSS, and SQLi in the Zeek log - oh my!",
    "And I'd be shocked if there weren't some shell stuff in there too.",
    "I'll bet if you pick through, you can find some naughty data from naughty hosts and block it in the firewall.",
    "If you find a log entry that definitely looks bad, try pivoting off other unusual attributes in that entry to find more bad IPs.",
    "The sleigh's machine learning device (SRF) needs most of the malicious IPs blocked in order to calculate a good route.",
    "Try not to block many legitimate weather station IPs as that could also cause route calculation failure.",
    "Remember, when looking at JSON data, `jq` is the tool for you!"
  ],
  "krampus-sleighroom": [
    "But there’s still time! Solve the final challenge in your badge by blocking the bad IPs at [srf.elfu.org](https://srf.elfu.org/) and save the holiday season!",
    "..."
  ],
  "toothfairy-sleighroom": [
    "I’m the Tooth Fairy, the mastermind behind the plot to destroy the holiday season.",
    "I hate how Santa is so beloved, but only works one day per year!",
    "He has all of the resources of the North Pole and the elves to help him too.",
    "I run a solo operation, toiling year-round collecting deciduous bicuspids and more from children.",
    "But I get nowhere near the gratitude that Santa gets.  He needs to share his holiday resources with the rest of us!",
    "But, although you found me, you haven’t foiled my plot!",
    "Santa’s sleigh will NOT be able to find its way.",
    "I will get my revenge and respect!",
    "I want my own holiday, National Tooth Fairy Day, to be the most popular holiday on the calendar!!!",
    "..."
  ],
  "krampus-lastroom": [
    "Congratulations on a job well done!",
    "Oh, by the way, I won the Frido Sleigh contest.",
    "I got 31.8% of the prizes, though I'll have to figure that out.",
    "..."
  ],
  "toothfairy-lastroom": [
    "You foiled my dastardly plan!  I’m ruined!",
    "And I would have gotten away with it too, if it weren't for you meddling kids!",
    "..."
  ],
  "santa-lastroom": [
    "You did it!  Thank you!  You uncovered the sinister plot to destroy the holiday season!",
    "Through your diligent efforts, we’ve brought the Tooth Fairy to justice and saved the holidays!",
    "Ho Ho Ho!",
    "The more I laugh, the more I fill with glee.",
    "And the more the glee,",
    "The more I'm a merrier me!",
    "Merry Christmas and Happy Holidays.",
    "..."
  ],
  "tooth": [
    "I'm Jason!",
    "Also, a tooth!",
    "..."
  ],
  "sugarplummary": [
    "Oh me oh my - I need some help!",
    "I need to review some files in my Linux terminal, but I can't get a file listing.",
    "I know the command is *ls*, but it's really acting up.",
    "Do you think you could help me out? As you work on this, think about these questions:",
    "1. Do the words in green have special significance?",
    "2. How can I find a file with a specific name?",
    "3. What happens if there are multiple executables with the same name in my $PATH?",
    "...",
    "Oh there they are!  Now I can delete them.  Thanks!",
    "Have you tried the Sysmon and EQL challenge?",
    "If you aren't familiar with Sysmon, Carlos Perez has some great info about it.",
    "Haven't heard of the Event Query Language?",
    "Check out some of [Ross Wolf](https://www.endgame.com/our-experts/ross-wolf)'s work on EQL or that blog post by Josh Wright in your badge."
  ],
  "hollyevergreen": [
    "Hey! It's me, Holly Evergreen! My teacher has been locked out of the quiz database and can't remember the right solution.",
    "Without access to the answer, none of our quizzes will get graded.",
    "Can we help get back in to find that solution?",
    "I tried `lsof -i`, but that tool doesn't seem to be installed.",
    "I think there's a tool like `ps` that'll help too.  What are the flags I need?",
    "Either way, you'll need to know a teensy bit of Mongo once you're in.",
    "Pretty please find us the solution to the quiz!",
    "...",
    "Woohoo! Fantabulous! I'll be the coolest elf in class.",
    "On a completely unrelated note, digital rights management can bring a hacking elf down.",
    "That ElfScrow one can really be a hassle.",
    "It's a good thing Ron Bowes is giving a talk on reverse engineering!",
    "_That_ guy knows how to rip a thing apart.  It's like he *breathes* opcodes!"
  ],
  "alabastersnowball": [
    "Welcome to the Speaker UNpreparedness Room!",
    "My name's Alabaster Snowball and I could use a hand.",
    "I'm trying to log into this terminal, but something's gone horribly wrong.",
    "Every time I try to log in, I get accosted with ... a hatted cat and a toaster pastry?",
    "I thought my shell was Bash, *not* flying feline.",
    "When I try to overwrite it with something else, I get permission errors.",
    "Have you heard any chatter about immutable files? And what is `sudo -l` telling me?",
    "...",
    "Who would do such a thing??  Well, it IS a good looking cat.",
    "Have you heard about the Frido Sleigh contest?",
    "There are some serious prizes up for grabs.",
    "The content is strictly for elves. Only elves can pass the CAPTEHA challenge required to enter.",
    "I heard there was a talk at KCII about using machine learning to defeat challenges like this.",
    "I don't think anything could ever beat an elf though!"
  ],
  "sparkleredberry": [
    "I'm Sparkle Redberry and Imma chargin' my laser!",
    "Problem is: the settings are off.",
    "Do you know any PowerShell?",
    "It'd be GREAT if you could hop in and recalibrate this thing.",
    "It spreads holiday cheer across the Earth ...",
    "...  when it's working!",
    "...",
    "You got it - three cheers for cheer!",
    "For objective 5, have you taken a look at our Zeek logs?",
    "Something's gone wrong.  But I hear someone named Rita can help us.",
    "Can you and she figure out what happened?"
  ],
  "profbanas": [
    "Hi, I'm Dr. Banas, professor of Cheerology at Elf University.",
    "This term, I'm teaching \"HOL 404: The Search for Holiday Cheer in Popular Culture,\" and I've had quite a shock!",
    "I was at home enjoying a nice cup of Gløgg when I had a call from Kent, one of my students who interns at the Elf U SOC.",
    "Kent said that my computer has been _hacking_ other computers on campus and that I needed to fix it ASAP!",
    "If I don't, he will have to report the incident to the boss of the SOC.",
    "Apparently, I can find out more information from this website [https://splunk.elfu.org/](https://splunk.elfu.org/) with the username: `elf` / Password: `elfsocks`.",
    "I don't know anything about computer security.  Can you please help me?",
    "...",
    "Oh, thanks so much for your help! Sorry I was freaking out.",
    "I've got to talk to Kent about using my email again...",
    "...and picking up my dry cleaning."
  ],
  "pepperminstix": [
    "It's me - Pepper Minstix.",
    "Normally I'm jollier, but this Graylog has me a bit mystified.",
    "Have you used Graylog before? It is a log management system based on Elasticsearch, MongoDB, and Scala.",
    "Some Elf U computers were hacked, and I've been tasked with performing incident response.",
    "Can you help me fill out the incident response report using our instance of Graylog?",
    "It's probably helpful if you know a few things about Graylog.",
    "Event IDs and Sysmon are important too.  Have you spent time with those?",
    "Don't worry - I'm sure you can figure this all out for me!",
    "Click on the _All messages_ Link to access the Graylog search interface!",
    "Make sure you are searching _in all messages_!",
    "The Elf U Graylog server has an integrated incident response reporting system. Just mouse-over the box in the lower-right corner.",
    "Login with the username `elfustudent` and password `elfustudent`.",
    "...",
    "That's it - hooray!",
    "Have you had any luck retrieving scraps of paper from the Elf U server?",
    "You might want to look into SQL injection techniques.",
    "OWASP is always a good resource for web attacks.",
    "For blind SQLi, I've heard Sqlmap is a great tool.",
    "In certain circumstances though, you need custom tamper scripts to get things going!"
  ],
  "mintycandycane": [
    "Hi!  I'm Minty Candycane!",
    "I just LOVE this old game!",
    "I found it on a 5 1/4\" floppy in the attic.",
    "You should give it a go!",
    "If you get stuck at all, check out this year's talks.",
    "One is about web application penetration testing.",
    "Good luck, and don't get dysentery!",
    "...",
    "You made it - congrats!",
    "Have you played with the key grinder in my room?  Check it out!",
    "It turns out: if you have a good image of a key, you can physically copy it.",
    "Maybe you'll see someone hopping around with a key here on campus.",
    "_Sometimes you can find it in the Network tab of the browser console._",
    "Deviant has a great talk on it at this year's Con.",
    "He even has a collection of key bitting templates for common vendors like Kwikset, Schlage, and Yale."
  ],
  "krampus-steamtunnel": [
    "Hello there!  I’m Krampus Hollyfeld.",
    "I maintain the steam tunnels underneath Elf U,",
    "Keeping all the elves warm and jolly.",
    "Though I spend my time in the tunnels and smoke,",
    "In this whole wide world, there's no happier bloke!",
    "Yes, I borrowed Santa’s turtle doves for just a bit.",
    "Someone left some scraps of paper near that fireplace, which is a big fire hazard.",
    "I sent the turtle doves to fetch the paper scraps.",
    "But, before I can tell you more, I need to know that I can trust you.",
    "Tell you what – if you can help me beat the [Frido Sleigh](https://fridosleigh.com/) contest (Objective 8), then I'll know I can trust you.",
    "The contest is here on my screen and at [fridosleigh.com](https://fridosleigh.com/).",
    "No purchase necessary, enter as often as you want, so I am!",
    "They set up the rules, and lately, I have come to realize that I have certain materialistic, cookie needs.",
    "Unfortunately, it's restricted to elves only, and I can't bypass the CAPTEHA.",
    "(That's Completely Automated Public Turing test to tell Elves and Humans Apart.)",
    "I've already cataloged [12,000 images](https://downloads.elfu.org/capteha_images.tar.gz) and decoded the [API interface](https://downloads.elfu.org/capteha_api.py).",
    "Can you help me bypass the CAPTEHA and submit lots of entries?",
    "...",
    "Wow!  We’ve uncovered quite a nasty plot to destroy the holiday season.",
    "We’ve gotta stop whomever is behind it!",
    "I managed to find this protected document on one of the compromised machines in our environment.",
    "I think our attacker was in the process of exfiltrating it.",
    "I’m convinced that it is somehow associated with the plan to destroy the holidays.  Can you decrypt it?",
    "There are some smart people in the NetWars challenge room who may be able to help us."
  ],
  "bushyevergreen": [
    "Hi, I'm Bushy Evergreen.  Welcome to Elf U!",
    "I'm glad you're here. I'm the target of a terrible trick.",
    "Pepper Minstix is at it again, sticking me in a text editor.",
    "Pepper is forcing me to learn ed.",
    "Even the hint is ugly. Why can't I just use Gedit?",
    "Please help me just quit the grinchy thing.",
    "...",
    "Wow, that was much easier than I'd thought.",
    "Maybe I don't need a clunky GUI after all!",
    "Have you taken a look at the password spray attack artifacts?",
    "I'll bet that DeepBlueCLI tool is helpful.",
    "You can check it out on GitHub.",
    "It was written by that Eric Conrad.",
    "He lives in Maine - not too far from here!"
  ],
  "santa-trainstation": [
    "Welcome to the North Pole and KringleCon 2!",
    "Last year, KringleCon hosted over 17,500 attendees and my castle got a little crowded.",
    "We moved the event to Elf University (Elf U for short), the North Pole’s largest venue.",
    "Please feel free to explore, watch talks, and enjoy the con!",
    "..."
  ]
}