{
  "jingleringford": [
    "Welcome to the North Pole, KringleCon, and the 2022 SANS Holiday Hack Challenge!  I’m Jingle Ringford, one of Santa’s elves.",
    "Santa asked me to come here and give you a short orientation to this festive event.",
    "Before you move forward through the gate, I’ll ask you to accomplish a few simple tasks.",
    "First things first, here's your badge! It's the five golden rings in the middle of your avatar.",
    "Great - now you're official! ",
    "Click on the badge on your avatar.  That’s where you will see your Objectives, Hints, and gathered Items for the Holiday Hack Challenge.",
    "We’ve also got handy links to the KringleCon talks and more there for you!",
    "Next, click on that machine to the left and create a crypto wallet for yourself. Don't lose that key!",
    "...",
    "Great!  Your orientation is now complete!  You can enter through the gate now.  Have FUN!!!"
  ],
  "chimneyscissorsticks": [
    "You may be wondering where Frost Tower from last year went.",
    "Well, it turns out the entire tower was a giant rocketship!",
    "After the Frostians returned last year and brought Jack Frost to justice…",
    "The entire building launched into space, returning Jack and the Trolls to their home planet.",
    "So that concluded last year’s caper! But I hear that something is amiss this year too!",
    "Some of my fellow elves have burrowed under the snow, and even deeper.",
    "They’ve uncovered some strange stuff down there!",
    "You should definitely check it out!",
    "..."
  ],
  "sansbooth": [
    "Happy holidays from the best college in cybersecurity!",
    "We have programs for bachelor's degrees, undergraduate certificates, master's degrees, and graduate certificates.",
    "Visit [our website](https://www.sans.edu/) to learn all about the college!",
    "..."
  ],
  "cyberus": [
    "woof! woof!!",
    "WHO SAID THAT??",
    "I’m Cyberus, the mascot of the [SANS.edu](https://www.sans.edu/) college!",
    "Go SANS.edu Sentinels!!!!",
    "..."
  ],
  "googlebooth": [
    "Google is a proud sponsor of KringleCon and the Holiday Hack Challenge. We wish you a happy holiday hacking season.",
    "[Meet Security Engineers at Google](https://www.youtube.com/watch?v=-6ZbrfSRWKc)",
    "..."
  ],
  "santaapproach": [
    "Welcome to the North Pole, intrepid traveler!",
    "Wow, we had quite a storm last night!",
    "My castle door is sealed shut behind a giant snowbank.",
    "The Elves have decided to burrow under the snow to get everything ready for our holiday deliveries.",
    "But there's another wrinkle: my Five Golden Rings have _gone missing_.",
    "Without the magic of the Rings, we simply can't launch the holiday season.",
    "My reindeer won't fly; I won't be able to zip up and down chimneys.",
    "What's worse, without the magic Rings, I can't fit the millions of cookies in my belly!",
    "I challenge you to go on a quest to find and retrieve each of the five Rings.",
    "I'll put some initial goals in your badge for you.",
    "The holidays, and the whole world, are counting on you.",
    "...",
    "Adventurer! Hurry on into my castle. A holiday miracle has occured!"
  ],
  "northpole": [
    "I'm the North Pole!",
    "If you have a keen eye, you may have noticed that I changed location from last year.",
    "If you're into science, and you want to know how I managed to move, [check this out](https://www.bbc.com/news/science-environment-52550973)!",
    "..."
  ],
  "garlandcandlesticks": [
    "Hi, I'm Garland Candlesticks. Welcome to the Netwars room!",
    "The same whimsical minds behind this event also build other games.",
    "I mean ranges. They're cyber ranges.",
    "And they're for training - not fun. Not even a little. 😄",
    "..."
  ],
  "callingbird1": [
    "GREAT JOB!",
    "..."
  ],
  "callingbird3": [
    "BEEP BEEP!",
    "..."
  ],
  "callingbird2": [
    "I managed to convince the boss to give you the best price EVER!",
    "..."
  ],
  "callingbird4": [
    "You hit the jackpot!",
    "..."
  ],
  "rosemold": [
    "I'm Rose Mold. What planet are _you_ from?",
    "What am _I_ doing here? I could ask the same of you!",
    "Collecting web, cloud, elfen rings...  What about onion rings?  A Sebring?",
    "n00bs...",
    "..."
  ],
  "santaentry": [
    "Congratulations! You have foiled Grinchum's foul plan and recovered the Golden Rings!",
    "And by the magic of the rings, Grinchum has been restored back to his true, merry self: Smilegol!",
    "You see, all Flobbits are drawn to the Rings, but somehow, Smilegol was able to snatch them from my castle.",
    "To anyone but me, their allure becomes irresistable the more Rings someone possesses. ",
    "That allure eventually tarnishes the holder's Holiday Spirit, which is about *giving*, not possesing.",
    "That's exactly what happened to Smilegol; that selfishness morphed him into Grinchum.",
    "But thanks to you, Grinchum is no more, and the holiday season is saved!",
    "Ho ho ho, happy holidays!",
    "..."
  ],
  "smilegolentry": [
    "I must give you my most thankful of thanks, and most sorry of sorries.",
    "I'm not sure what happened, but I just couldn't resist the Rings' call.",
    "But once you returned the Rings to Santa, I was no longer so spellbound.",
    "I could think clearly again, so I shouted off that awful persona. ",
    "And that grouchy Grinchum was gone for good. Now, I can be me again, just in time for gift giving.",
    "This is a lesson I won't soon forget, and I certainly won't forget you.",
    "I wish you smooth sailing on wherever your next voyage takes you!",
    "..."
  ],
  "evesnowshoes": [
    "Hello there, super helper! I'm Eve Snowshoes.",
    "The other elves and I are *so* glad you were able to help recover the rings!",
    "The holidays wouldn't have been the same without your hard work.",
    "If you'd like, you can order [special swag](https://my-store-d61669.creator-spring.com/) that's *only* available to our victors!",
    "Thank you!",
    "..."
  ],
  "angelcandysalt": [
    "Greetings North Pole savior! I'm Angel Candysalt!",
    "A euphemism? No, that's my name. Why are people _still_  asking me that?",
    "Anywho, thank you for everything you've done.",
    "You'll go down in history!",
    "..."
  ],
  "timpytoque": [
    "Thank you for saving Smilegol and protecting the Rings.",
    "You will always be a friend of the Flobbits.",
    "..."
  ],
  "canary1": [
    "_chirp_",
    "I tot I taw a Grinchum... ",
    "I did, I did!",
    "_chirp chirp_",
    "..."
  ],
  "grinchum": [
    "😏 _My..._",
    "_Preciousesss...._",
    "_Don't worry, you are hidden. You are safe._",
    "...",
    "😒_Who took you, Precious? How did they take you? Mustn't happen again._ ",
    "🙂 **Oh, hello, humanses. Maybe we can offer help?**",
    "😏 **Yes... Grinchum will help the humanses.**",
    "_We are trying to distract them from finding the rest of you, Preciouses, with talk of hints and coinses._",
    "🙂 **Have you found the coffers yet? The ones at the end of hidden paths?**",
    "😏 **There's hintses in them, and coinses, they're veeerrryy special.**",
    "🙂 **Just look hard, for little, bitty, speckles or other oddities.**",
    "_Don't worry, they will not look for you, Preciouses. Shhh..._",
    "🙂 **Go on, humanses. Start searching!**",
    "😖 _A second Precious is gone! Now we only have three._",
    "🤨 **Why are you humanses nagging us? We are busy.** _grinchum..grinchum_",
    "**You want to know about us? If we tell the naggy human, will it go away? Fine...**",
    "🥺 **The jolly human and the elfses locked up the Preciouses, but I freed them all, and together we escaped.** ",
    "**We fled, and we were so alone. We soon forgot the taste of Lembanh, the softness of snowflakes falling, even our name.**",
    "**And we only wanted to eat raw fish: nigiri, maki, or shashimi. But we most likes gnawing the whole, living fish, so juicy sweet.**",
    "**Then we saw the Sporcses, and they wanted my Preciouses all to themselves.**",
    "**And the humanses came, but they just want coinses for their silly hats.**",
    "**We only meant to protect you, Preciouses, from the naughty Elfses and Flobbitses and Sporcses, so we locked you away.**",
    "😏 **Now leave us alone, naggy human, we must find the two missing Preciouses.**",
    "😏 _First lost... second lost... third lost._ 😟",
    "_Where are they?_ 😦 _WHERE ARE THEY, preciouses?_",
    "_No! Aaargh! Lost!_",
    "😖 **You - naggy human. Musn't bother us. 😱 Not its business!** _grinchum..grinchum_",
    "🥺 _Four Preciouses - lost!_",
    "😫 _Noooo... grinchum..grinchum_",
    "😐 **..... naggy human doesn't _only_ want coinses and hatses.**",
    "**...What... 🤨has it got...**",
    "😠 **in its silly, little, badges!?**",
    "😧**Stole them... 😠 You STOLE them!**",
    "😡 **Raaaargh!! We will make sure naggy human never takes our last Precious!**",
    "😠 _We wants them... we needs them... Must.. have.. the Preciouses._",
    "_They stole them from us, sneaky little humanses._",
    "🙂 _No, not the humanses, they're my friends._",
    "😏 _You don't have any friends. NOBODY likes YOU. You're a liar, and a thief, and a.... grriiiiiiinch._",
    "😢 _Go away... we don't need you anymore. The humanses protect us now._",
    "😠 _Go away? I protected us. The preciouses are safe because of ME!_",
    "🙂 _Leave now, and never.. come back._ 😃 _Leave now, and never.. come back!_",
    "😁_LEAVE NOW, AND NEVER.. COME BACK!_😬",
    "**Friendly human, please go to jolly human's castle! Go on, we will meet you there!**"
  ],
  "morcelnougat": [
    "Hello, I'm Morcel Nougat, elf extraordinaire!",
    "I was in the first group of elves that started digging into the snow.",
    "Eventually, we burrowed deep enough that we came upon an already existing tunnel network.",
    "As we explored it, we encountered a people that claimed to be the Flobbits.",
    "We were all astonished, because we learn a little about the Flobbits in history class, but nobody's ever seen them.",
    "They were part of the Great Schism hundreds of years ago that split the Munchkins and the Elves.",
    "Not much else was known, until we met them in the tunnels! Turns out, their exodus took them to Middle Earth.",
    "They only appear when the 5 Rings are in jeopardy. Though, the Rings weren't lost until after we started digging. Hmm...",
    "Anyways, be careful as you venture down further. I hear something sinister is in the depths of these tunnels.",
    "..."
  ],
  "canary2": [
    "_chirp_",
    "Did you know us canaries have a very storied history?",
    "We were once considered fashionable, and only owned by royalty who cherished us for our beautiful songs.",
    "Oh, and have you ever heard the saying [\"Canary in a coal mine\"](https://en.wikipedia.org/wiki/Domestic_canary)?",
    "_chirp chirp_",
    "..."
  ],
  "tanglecoalbox": [
    "Hey there, Gumshoe. Tangle Coalbox here again.",
    "Morcel told you all about the Flobbits, right? Well, be careful ahead.",
    "Once thought to be the stuff of myths, the Sporcs truly are real, and as mean as they are in the stories.",
    "Once we gained the Flobbits' trust, they taught us all about the Sporcs. They, too, were part of the Great Schism.",
    "They were another people who split off from the colony of Frostians in Oz, though, they're more closely related to the trolls.",
    "The Flobbits, on the other hand, are more like the Munchkins. Like the Flobbits, the Sporcs appear when the rings are at risk.",
    "Digging far down into the ground causes them to emerge, too. Seems we created a perfect storm. Whoops!",
    "They're definitely up to no good, and trying to get the Rings for themselves. Tread lightly, friend, and good luck!",
    "..."
  ],
  "canary3": [
    "_cough_",
    "ello poppet!",
    "_cough cough_",
    "..."
  ],
  "brozeek": [
    "Cro! Slicmer got me on the BSRS pre-sale!",
    "Now all we gotta do is swap outfits, then you can go back in there as me.",
    "Tell Slicmer you lost your wallet key, so you made a new wallet and need to add it to the list.",
    "Then give him your wallet address, and we'll both be able to buy an NFT!",
    "Social engineering at its finest, Cro.",
    "..."
  ],
  "crozag": [
    "Bro, you usually have good ideas, but this one is really terrible.",
    "Manipulating friends with social engineering isn't cool, Bro.",
    "Let's do it!",
    "...",
    "That Chorizo guy, Bro...",
    "What a snob. It makes sense he wasn't invited to the pre-sale."
  ],
  "handle": [
    "Hey! It's me, Jason!",
    "I'm not dead. I'm merely resting.",
    "Look at my beautiful yellow plumage!",
    "..."
  ],
  "sparkleredberry": [
    "You got it - wonderful!",
    "So hey, when you're looking at the next terminal, remember you have multiple filetypes and tools you can utilize.",
    "Conveniently for us, we can use programs already installed on every Windows computer.",
    "So if you brought your own Windows machine, you can save the files to it and use whatever method is your favorite.",
    "Oh yeah! If you wanna learn more, or get stuck, I hear [Eric Pursley's talk](https://youtu.be/5NZeHYPMXAE) is about this very topic.",
    "..."
  ],
  "dustygiftwrap": [
    "Say, you did it! Thanks a million!",
    "Now we can mix in the proper ingredients and stop attracting the Snowrog!",
    "I'm all set now! Can you help Fitzy over there wield the exalted Suricata?",
    "It can be a bit mystifying at first, but this [Suricata Tome](https://suricata.readthedocs.io/en/suricata-6.0.0/rules/intro.html) should help you fathom it. ",
    "I sure hope you can make it work!",
    "..."
  ],
  "fitzyshortstack": [
    "Hm?.. Hello...",
    "Sorry, I don't mean to be uncharaceristically short with you.",
    "There's just this abominable Snowrog here, and I'm trying to comprehend Suricata to stop it from getting into the kitchen.",
    "I believe that if I can phrase these Suricata incantations correctly, they'll create a spell that will generate warnings.",
    "And hopefully those warnings will scare off the Snowrog!",
    "Only... I'm quite baffled. Maybe you can give it a go?",
    "...",
    "Woo hoo - you wielded Suricata magnificently! Thank you!",
    "Now to shout the final warning of power to the Snowrog...",
    "YOU...SHALL NOT...PASS!!!"
  ],
  "snowrog": [
    "_Fierce gusts of wind wreath about it and snow swirls in its aura_",
    "_Its frozen mane shimmers, and chilled air fogs behind it_ ",
    "_Its left hand made of fingers of tongue-affixing icicles_",
    "_Its right a fist like that of a densely packed snowball_",
    "_The Snowrog focuses on you with an icy-cold glare_",
    "_And bellows a roar more thunderous than an avalanche_",
    "..."
  ],
  "bowninecandle": [
    "Well hello! I'm Bow Ninecandle!",
    "Have you ever used Git before? It's so neat!",
    "It adds so much convenience to DevOps, like those times when a new person joins the team.",
    "They can just clone the project, and start helping out right away!",
    "Speaking of, maybe you could help me out with cloning this repo?",
    "I've heard there's multiple methods, but I only know how to do one.",
    "If you need more help, check out the [panel of very senior DevOps experts.](https://youtu.be/vIQY_FH1SVk)",
    "...",
    "Wow - great work! Thank you!",
    "Say, if you happen to be testing containers for security, there are some things you should think about.",
    "Developers love to give ALL TeH PERMz so that things \"just work,\" but it can cause real problems.",
    "It's always smart to check for excessive user and container permissions.",
    "You never know! You might be able to interact with host processes or filesystems!"
  ],
  "alabastersnowball": [
    "Hey there! I'm Alabaster Snowball",
    "And I have to say, I'm a bit distressed.",
    "I was working with the dwarves and their Boria mines, and I found some disturbing activity!",
    "Looking through [these artifacts](https://storage.googleapis.com/hhc22_player_assets/boriaArtifacts.zip), I think something naughty's going on.",
    "Can you please take a look and answer a few questions for me?",
    "First, we need to know where the attacker is coming from.",
    "If you haven't looked at Wireshark's *Statistics* menu, this might be a good time!",
    "...",
    "Alice? I totally expected Eve! Well how about forced browsing? What's the first URL path they found that way?",
    "The misses will have HTTP status code `404` and, in this case, the successful guesses return `200`.",
    "Great! Just one more challenge! It looks like they made the server pull credentials from IMDS. What URL was forced?",
    "AWS uses a specific IP address for IMDS lookups. Searching for that in the PCAP should get you there quickly.",
    "Fantastic! It seems simpler now that I've seen it once.  Thanks for showing me!",
    "Hey, so maybe I can help you out a bit with the door to the mines.",
    "First, it'd be great to bring an Elvish keyboard, but if you can't find one, I'm sure other input will do.",
    "Instead, take a minute to read the HTML/JavaScript source and consider how the locks are processed.",
    "Next, take a look at the `Content-Security-Policy` header. That drives how certain content is handled.",
    "Lastly, remember that input sanitization might happen on either the client or server ends!"
  ],
  "haltandybuck": [
    "Oh hi, I'm Hal Tandybuck. And who might you be?",
    "I'm hanging out by the door to the mines here because, well, I haven't figured out the locks yet.",
    "It actually reminds me of this locked crate I had three years ago...",
    "I doubt we'll get much in the way of debug output.",
    "Think you can help me get through?",
    "...",
    "Wha - what?? You opened all the locks?!  Well then...",
    "Did you see the nearby terminal with evidence of an XXE attack?",
    "Maybe take a close look at that kind of thing."
  ],
  "sulfrod": [
    "Hey! You - come here!",
    "You look like someone who knows how to do this nerd stuff.",
    "I need my terminal to be stronger, like me! ",
    "_flexes_",
    "You're gonna do that for me so I can bust into this cloud machine thing.",
    "...",
    "Ha! Now I have the ring!",
    "This computer stuff sure is easy if you just make someone do it for you.",
    "Wait.. the computer gave **you** the ring? Gah, whatever.",
    "This never happened, got it? Now beat it, nerd!"
  ],
  "gertysnowburrow": [
    "Well now, look who's venturing down into the caves!",
    "And well, who might you be, exactly?",
    "I'm Gerty Snowburrow, if you need to know.",
    "And, not that I should be telling you, but I'm trying to figure out what Alabaster Snowball's done this time.",
    "Word is, he committed some secrets to [a code repo](https://haugfactory.com/asnowball/aws_scripts.git).",
    "If you're feeling so inclined, you can try and find them for me.",
    "...",
    "Say, you got it done, didn't you?",
    "Well now, you might just be able to tackle the other AWS terminal down here.",
    "It's a bit more involved, but you've got the credentials to get it started now.",
    "Before you try it, you should know the difference between managed and inline policies.",
    "Short version: inline policies apply to one identity (user, role, group), and managed policies can be attached to many identities.",
    "There are different AWS CLI commands to interact with each kind.",
    "Other than that, the important bit is to know a bit about cloud or IAM privilege escalation.",
    "Sometimes attackers find access to more resources by just trying things until something works.",
    "But if they have access to the `iam` service inside the AWS CLI, they might just be able to ask what access they have!",
    "You can do it!"
  ],
  "jillunderpole": [
    "Umm, can I help you?",
    "Me? I'm Jill Underpole, thank you very much.",
    "I'm working on this here smoke terminal.",
    "Cloud? Sure, whatever you want to call it.",
    "Anyway, you're welcome to try this out, if you think you know what you're doing.",
    "You'll have to learn some basics about the AWS command line interface (CLI) to be successful though.",
    "...",
    "Wait, you got it done, didn't you?",
    "Ok, consider me impressed. You could probably help Gerty, too.",
    "The first trick'll be running the Trufflehog tool.",
    "It's as good at sniffing out secrets as I am at finding mushrooms!",
    "After that, it's just a matter of getting to the secret the tool found.",
    "I'd bet a basket of portobellos you'll get this done!"
  ],
  "wombleycube": [
    "Hey there! I'm Wombley Cube. It's so nice to see a friendly face.",
    "What's an elf doing all the way down here with all these sporcs, you ask?",
    "I'm selling snazzy, fancy-pants hats! You can buy them with Kringlecoin.",
    "_The reason I set up shop here is to gather intel on that shady Luigi._",
    "_I'm a member of the STINC: Santa's Team of Intelligent Naughty Catchers._",
    "_He and his gang are up to no good, I'm sure of it. We've got a real Code Brown here._",
    "_Purchase a hat so we look inconspicuous, and I'll clue you in on what we think they're scheming._",
    "Of course, have a look at my inventory!",
    "_Oh, and if you haven't noticed, I've slipped hints for defeating these Sporcs around the tunnels!_",
    "_Keep your eyes open, and you'll find all five of them. Wait, maybe it's six?_",
    "...",
    "Nice hat! I think Ed Skoudis would say the same. It looks great on you.",
    "_So, here's what we've uncovered so far. Keep this confidential, ok?_",
    "_Earlier, I overheard that disgruntled customer in the office saying he wanted in on the \"rug pull\"._",
    "_If our suspicions are correct, that's why the sporcs want an invite to the presale so badly._",
    "_Once the \"Bored Sporc Rowboat Society\" NFTs officially go on sale, the sporcs will upsell them._",
    "_After most of the NFTs are purchased by unwitting victims, the Sporcs are going to take the money and abandon the project._",
    "_Mission #1 is to find a way to get on that presale list to confirm our suspicions and thwart their dastardly scheme!_",
    "_We also think there's a Ring hidden there, so drop Mission #2 on them and rescue that ring!_",
    "Thank you for your business, dear customer!",
    "You've done your duty, agent.",
    "Excellent work, especially on Mission #2! I'll log this entry back at STINC HQ.",
    "Keep doing work like this, and you'll be sitting on the STINC throne, leading the agency someday.",
    "Nobody will know of the job you did here today, but the STINC thanks you.",
    "I'm just being dramatic, **everyone's** gonna know how awesome you are!"
  ],
  "palzari": [
    "Hello, dear. Come down to visit your tiddly elf friend?",
    "You two are just adorable, playing hero and braving our flaming domain.",
    "Sure, we'll tolerate you playing here, but please behave, won't you? ",
    "Use this KTM to buy your darling little hats, and nothing more. If you decide to be a brat, well...",
    "I'll disappear you into the Devnull Chasm, and nobody will ever see you again. Do we have an understanding?",
    "Very good. Run along now, dear.",
    "...",
    "Tsk tsk tsk, I thought I told you to play nice?",
    "The only reason you're not in time-out is because Luigi doesn't seem convinced that you're a little rascal.",
    "He's not as clever as he likes to think. But once he comes around...",
    "You better watch out, dear. And when I catch you, you better not cry. Or do, not even Santa will hear you."
  ],
  "chorizo": [
    "Do you not have the slightest inclination of who I am?",
    "How did I, Count Chorizo, Herald of Rrrrepugnance, not receive an invitation to the presale?",
    "I could purchase every one of your wares, but now you shan't have a single cent from me!",
    "I will see to it that you **nevah** do business in these warrens agayn!",
    "...",
    "_Well...I...never..._",
    "How was a plebeian such as yourself granted access to the pre-sale?",
    "I present thee with a proffer to purchase the NFT you've acquired for twice the price.",
    "Hwhat? You shan't vend to me? Have you any idea who I am?",
    "You just refused the abhorrent Count Chorizo!",
    "I shall ensure you are **nevah** able to transact with that NFT agayn!"
  ],
  "luigi": [
    "Psst. Hey, slick - over here. Myeah.",
    "You look like a sucker *ahem* I mean, savvy. ",
    "I got some exclusive, very rare, very valuable NFTs for sale.",
    "But I run a KringleCoin-only business. Kapeesh?",
    "Ever buy somethin' with cryptocurrency before?",
    "Didn't think so, but if you wheel and deal with ya' pal Luigi here, now you can!",
    "But we're currently in pre-sale, and you gotta be on the list.  Myeah, see?",
    "BSRS NFTs are a swell investment. They'll be worth a pretty penny, and that's a promise. ",
    "So when they're purchasable, you better snatch 'em up before the other boneheads *ahem* I mean,  eggheads do.",
    "I got a business to run. You can't buy nothin' right now, so scram. Kapeesh?",
    "...",
    "What!? How'd you get on the list? What's that? You's a double agent, and you're actually workin' for us? ",
    "I don't know if I buy that, but you're on the list, so... myeah.",
    "Somethin' about this ain't sittin' right with me, but there's no reversing transactions with cryptocurrency.",
    "That NFT is yours to keep, but if I find out you're lyin' to me, Palzari's gonna pay you a visit. Kapeesh?"
  ],
  "slicmer": [
    "Don't bug me, kid. Luigi needs me to keep an eye on these offers you can't refute. ",
    "The boss told me to watch them for any shifty transactions from wallets that aren't on the pre-sale list.",
    "He said to use this Block Explo... Exploder... thing.",
    "With this, I can see all the movement of the uh... non-fungusable tokens.",
    "Once on the blockchain, it's there forever for the whole world to see.",
    "So if I spot anything that don't look right, I can let Luigi know, and Palzari will get to the bottom of it.",
    "She looks sweet, but she's actually the boss' enforcer. Have you talked to her yet? She even scares me!",
    "It sure would be fun to watch you get on her bad side. Heh heh.",
    "...",
    "Hmph... this is so **boring**...",
    "\"This is a serious task\" he said, \"not a sporc headbutting-party\" he said.",
    "\"Mess this up, Slicmer, and I'll tie a rock to your feet and throw you down a well!\" he said. ",
    "I think this job was just to keep me out of his way. Luigi thinks I'm a blockhead.",
    "Well I think _he's_ a -- Huh? Wait a minute...",
    "Hey! Boss! I think I see somethin'!"
  ],
  "rippinproudboot": [
    "Have you managed to help Tinsel with his prison escape?",
    "...",
    "How unexpected, you were actually able to help!",
    "Well, then I must apoligize for my dubious greeting.",
    "Us Flobbits can't help it sometimes, it's just in our nature.",
    "Right then, there are other Flobbits that need assistance further into the burrows.",
    "Thank you, and off you go."
  ],
  "tinselupatree": [
    "Hiya hiya, I'm Tinsel Upatree!",
    "Check me out, I'm working side-by-side with a real-life Flobbit. Epic!",
    "Anyway, would ya' mind looking at this terminal with me?",
    "It takes a few seconds to start up, but then you're logged into a super secure container environment!",
    "Or maybe it isn't so secure? I've heard about container escapes, and it has me a tad worried.",
    "Do you think you could test this one for me? I'd appreciate it!",
    "...",
    "Great! Thanks so much for your help!",
    "Now that you've helped me with this, I have time to tell you about the deployment tech I've been working on!",
    "Continuous Integration/Continuous Deployment pipelines allow developers to iterate and innovate quickly.",
    "With this project, once I push a commit, a GitLab runner will automatically deploy the changes to production.",
    "WHOOPS! I didn’t mean to commit that to `http://gitlab.flag.net.internal/rings-of-powder/wordpress.flag.net.internal.git`...",
    "Unfortunately, if attackers can get in that pipeline, they can make an awful mess of things!"
  ],
  "akbowl": [
    "Huh - what? Why do you disturb Akbowl?",
    "I'm trying to get the ring in here for the Sporc Chief.",
    "Unlucky for me it's lost in this water basin thing.",
    "You will *not* get it out before Akbowl!",
    "...",
    "No! That's not yours!",
    "This birdbath showed me images of this happening.",
    "But I didn't believe it because nobody is better than Akbowl!",
    "Akbowl's head is the hardest! That's what the other sporcs tell me.",
    "I guess Akbowl's head is not the smartest."
  ]
}